{
  "date": "2017-03-12T18:17:00.000Z",
  "title": "North Table Mountain",
  "body": "We love doing hikes around Denver, This weekend we did North Table Mountain. By \"we love doing hikes\" I really mean \"Randi loves hiking and I feel less remorse about drinking to much beer and Mountain Dew during the week if I pretend to exercise for a few hours on the weekend\". If you are looking for a hike with under an hour drive of downtown Denver North Table Mountain is in our top 5. \n\nSome quick stats of the of the hike:\n\n* Date & Time: March 12, 2017 9 AM\n* Temperature at starting: 40 degrees \n* Wind: Between blustery and squally\n* Distance: 7.3 miles\n* Duration: 2 hours, 36 minutes, and 35 seconds\n* Average Speed: 2.8 mph\n* Minimum Elevation: 5867 feet\n* Maximum Elevation: 6499 feet\n* Total climb: 1022 feet\n* Total descent: 1132 feet\n\n<iframe src=\"https://www.google.com/maps/d/embed?mid=1mILyP3JNyc6YMfjTXd_YSsBZMBg&hl=en\" width=\"640\" height=\"480\"></iframe>\n\nAs you can see we didn't start tracking our hike until after we left the parking lot, but, its not to far off. A friend was controlling the GPS and remembered to turn it on at all, so no room to be frustrated with him at all... It is totally cool to get frustrated with the first section though. At the car I was shivering like a pathetic pile of non-manly man... (un)luckily The hike begins with a ~450 vertical feet climb over the first 1/2 mile. So the cold was quickly replaced with breathing pain and regret.\n\n![The initial climb](/images/co-table-climb.jpeg)\n\n![What first hill, 😅 woof ](/images/co-table-elevation.png)\n\nThe front half of the hike is up onto the top of table mountain then you circle around the masa. It has some interesting views of Denver, the airport, and DTC. Its crazy to be able to see the tents of DIA from Golden. In the summer there are frequently rock climbers during this first section.\n\n![Seeing Denver from the distance](/images/co-table-view-from-top.jpeg)\n\nThe middle section of the hike turns around and faces the front range hills. This section is mostly flat and on this specific hike was free of wind, so it felt pretty warm. We were really happy to dress in layers so we could pull of the jackets and enjoy some Colorado Sun!\n\n![Looks like they aren't pumped to wait](/images/co-table-waiting.jpeg)\n\nMike C. and Randi lead the pack for most of the hike...apparently they were not amused with Mike G, Elizabeth, and I's meandering in the back and picking up random weeds off the hiking trail.  \n\nBonus: Here is a cool timelapse video we took last time we were there!\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/L68x8-E4HdQ\" frameborder=\"0\" allowfullscreen alt=\"test\"></iframe>",
  "description": "North Table is a very accessible Denver hike!",
  "tag": [
    "Colorado Hiking"
  ],
  "author": [
    "Tyler"
  ],
  "thumbnail": "/images/co-table-view-from-top.jpeg"
}