{
  "date": "2018-06-04T14:12:00.000Z",
  "title": "La Plata",
  "body": "**Quick Stats:**\n\nSaturday, June 2, 2018 5:47 AM MDT\n\nDistance: 9.7 miles\n\nDuration: 8 hours, 3 minutes, and 13 seconds\n\nAverage Speed: 1.2 mph\n\nMinimum Elevation: 10109 feet\n\nMaximum Elevation: 14108 feet\n\nTotal climb: 4173 feet\n\n![Elevation Profile, up, up, and away!!!](/content/images/2018/06/La-Plata.png)\n\nThe first trailhead and camping spot was very easy to find. It is RIGHT off the paved road\n\n![Camping at the trailhead and eating breakfast](/content/images/2018/06/LaPlata1.jpg)\n\nThere is an okay sized parking lot (~15-20 cars) with plenty of semi-dispersed camping around. When we called the Leadville Rangers Station they said fires were permitted assuming they were inside existing fire rings.\n\nMost of our group took the camping spot that was positioned near the quick moving North Fork Lake Creek.\n\nThe real start of the path was down the public road from the trailhead.\n\n![The first 2000 verticle feet were all under treeline near the river](/content/images/2018/06/LaPlata2.jpg)\n\nIt was cool to be near running water for the first section of the hike without having to much worry about getting wet. There was only one log crossing and no one from our group fell in (this is rarer then it should be).\n\n![Quick break above tree line](/content/images/2018/06/LaPlata3.jpg)\n\nOur group was 6 large including one dog and two people new to the state who were still acclimating to the weather, all of which did an awesome job, but due to time and puppy paw constraints the group cut in half just above tree line.\n\nSnow was quite limited for being such an early season hike but still had a bit of snow on our way up and at the summit.\n\n![View from summit](/content/images/2018/06/LaPlata4.jpg)\n\nWe had a relatively peaceful trip with few other hikers on the path. The wind was really calm allowing us to not worry too much about freezing.\n\n![Neighboring Peaks](/content/images/2018/06/LaPlata5.jpg)\n\nFrom the top of La Plata we could see several neighboring peaks including Mt Elbert, the tallest point in Colorado.\n\n![Our friend the mighty roaring river](/content/images/2018/06/LaPlata6.jpg)\n\nThe river ran below most of the trail and under our campsite, it was loud and very pretty to look at. The rushing water ran about 20 feet below you so you didn't have to much of a concern about it rising all sneaky-like in the middle of the night.",
  "description": "La Plata, sub 10 mile fourteener with easy parking and a fair bit of elevation...",
  "thumbnail": "/images/LaPlata2.jpg",
  "tag": [
    "14ers"
  ],
  "author": [
    "Tyler"
  ]
}