{
  "date": "2018-07-14T14:29:00.000Z",
  "body": "During our brief weekend in Crested Butte we elected to hike the famed Crystal Mill, as neither Tyler nor I had seen the location. This hike is a difficult down then return uphill trek. The varied terrain, ranging from woods, aspens groves, canyons, and meadows make it well worth the journey.\n\n#### Quick Stats\n\nSaturday, June 23, 2018 7:14 AM MDT\n\nDistance: 14.8 miles (roundtrip)\n\nDuration: 5 hours, 55 minutes, and 57 seconds\n\nAverage Speed: 2.5 mph\n\nMinimum Elevation: 8905 feet\n\nMaximum Elevation: 10727 feet\n\nTotal climb: 3541 feet\n\nTotal descent: 3551 feet\n\nWe parked just shy of the summit of Schofield Pass. There was a great parking spot right at the temporary road closure sign (39°00'18.9\"N 107°01'51.3\"W) ~12 miles up Co Rd 317 from Crested Butte. We parked just shy of one mile from the beautiful Emerald Lake.\n\n![Our Crystal Mills Elevation Profile](/images/crystalmills.png)\n\n![Emerald Lake, just shy of the summit of Schofield Pass.](/images/crystalmills1.jpg)\n\nIn no time we had reached the summit of Schofield Pass...and with that, ~6 miles of downhill lay ahead of us.\n![Summit of Schofield Pass.](/images/crystalmills2.jpg)\n\nThe trail then opened up in a expansive meadow, where we had a brief reprieve from the descent and the bright sunshine on our shoulders.\n![Summit of Schofield Pass.](/images/crystalmills3-1.jpg)\n\nThe trail became rocky and steep as we neared Devil's Punch Bowl and the creek crossing of the South Fork Crystal River.\n![Devil's Punch Bowl in the early morning hours.](/images/crystalmills4.jpg)\n\n![First creek crossing...Randi surveying the deep waters.](/images/crystalmills5.jpg)\n\nI thought for sure we would have to wade across the deep creek, but then Tyler found a hidden gem to the west of the road...a magical single track that enabled us to avoid the two deep creek crossings! Score one for the Ty-Guy!\n\n![Just to the west of the road at the creek crossing is a small foot bridge with the signage \"Bridge to Terabithia\"...saved us from the creek crossings.](/images/crystalmills6.jpg)\n\nThe little single track popped out right at the second creek crossing through the willows.\n\n![A picture of where the single track put us back onto Schofield Pass Road...right through the willows straight ahead.](/images/crystalmills7.jpg)\n\nThe trail then descended into a gorgeous canyon. With each mile we hiked down, we knew the trek up would be warm and steep.\n\n![The water rushed down the canyon along side us.](/images/crystalmills8.jpg)\n\nA large rock slide stood in the middle of the path, blocking the ATVs, Side-by-Sides, and other 4WD adventurers...only hikers and bikers are passing through now.\n\n![A Randi for scale.](/images/crystalmills9.jpg)\n\nAfter crossing a small bridge we continued down and down into the town of Crystal.\n\n[Tyler's photo-sphere pic.](https://photos.app.goo.gl/JETKHAoa8ThkGp9j8)\n\n![The small town of Crystal.](/images/crystalmills10.jpg)\n\nFinally, our destination was reached...Crystal Mills.\n\n![crystalmills11](/images/crystalmills11.jpg)\n\nWe enjoyed some delightful homemade fudge mid-hike. We had gotten the treat the day before as we drove over Monarch Pass at the [Monarch Crest Gift Shop](https://monarchcrest.net/).\n\n![crystalmills12](/images/crystalmills12.jpg)\n\nAfter the short break it was time to make the seven-plus mile return trip...uphill...so much uphill.\n\n![crystalmills13](/images/crystalmills13.jpg)\n\n![Making our way back across the meadow towards Crested Butte.](/images/crystalmills14.jpg)\n\nAll in all, it was a bit longer than we anticipated, but well worth all the views and adventure.\n\n![As a bonus we were able to enjoy the end of Bike Week in Crested Butte, fourth weekend in June.](/images/crystalmills15.jpg)\n",
  "title": "Crested Butte to Crystal Mills via Schofield Pass",
  "description": "the location. This hike is a difficult down then return uphill trek. The varied terrain, ranging from woods, aspens groves, canyons, and meadows make it well worth the journey.",
  "thumbnail": "/images/crystalmills1.jpg",
  "tag": [
    "Colorado Hiking"
  ],
  "author": [
    "Randi"
  ]
}