{
  "date": "2017-08-13T14:06:00.000Z",
  "title": "Packing (Lite) List - for her",
  "body": "Packing lite was originally my husbands idea, but after a \"practice trip\" to Florida for a family beach vacation I was quickly on-board. The ease of traveling through the airport or managing public transit with a simple day-pack was utterly inspiring. For our upcoming three-week trip to Slovenia and Croatia I will be utilizing the packing list detailed below. I will be sure to provide an after-the-fact update upon our return to share any lessons learned.\n\n#### The Pack: CamelBak Helena 21L Backpack\n\nWhile I do not _love_ this pack, it is perfectly sufficent and gets the job done.\n\n![](/content/images/2017/08/RandiPack-small-1.jpg)\n\n#### Packing List:\n\n**Clothing** - one pair of hiking pants, one pair of hiking shorts, another pair of shorts (athletic), two tank tops (one fashion, one athletic), two dresses (one fashion, one athletic), two tee shirts (one fashion, one athletic), 1 sweater, 1 rain jacket, 5 pairs of underwear, two bras, one swimsuit\n\nThe majority of my clothing is poly-blend materials, with one wool tee-shirt and my black sweater is also a wool blend. This is strategic for two primary goals: quick-drying and moisture-wicking. These materials are 1) affordable (because an all wool wardrobe would be far too expensive), 2) comfortable (soft and fitting), 3) able to be washed in a hostel sink and dry out overnight, and 4) less likely to hold body odor. Wool, tencel, and poly-blends are by typical go-to preferences.\n\n![](/content/images/2017/08/Randiclothing-small.jpg)\n\n**Footwear** - two sandals (one fashion, one athletic)\n\nGiven the summer weather we will experience, I do not need to be mindful of warmth in my footwear, which is a huge space saver. The Keen Sandals (Clearwater CNX) are great for hiking around and water sports. The Croc (Really Sexi) Sandals were a huge surprise for me. I bought them two years ago for my last trip to Croatia. They are surprisingly durable and comfortable for miles of walking...and less than $30 (win!). These two pairs of shoes are probably my favorite travel items.\n\n![](/content/images/2017/08/randifootwear-small.jpg)\n\n**Toiletries** - sunscreen (Neutrogena sunscreen stick; so it does not count towards liquids!), deodorant, nail file, chapstick, lotion, shampoo, conditioner, bar of soap, luffa, facewash, toothbrush, toothpaste, razor, hairspray, comb, bag of bobby pins and hairbands\n\nAs a Coloradan, lotion and chapstick are addictions. For lotion, I searched far and wide for a non-liquid lotion, finally settling on this Shea Butter by Nubian Heritage. I have high hopes...we will see how it goes.\n\n![](/content/images/2017/08/RandiToiletries-small.jpg)\n\n**Other Items** - travel purse, travel towel (may be unnecessary, we shall see), ipod, phone with electronic books, sunglasses, water bottle (hydration is important), first aid kit (with Aspirin, moleskin, band-aids, laxatives, etc.)\n\nFor several travel adventures I have utilized this Vapur collapsible water bottle. It fits in my travel purse and is very convenient and lightweight. Only downside, it is only one liter, which is a bit smaller than I would prefer.\n\n![](/content/images/2017/08/randiWaterBottleSmall.jpg)\n\nMy travel purse is the Travelon Anti-Theft Classic Crossbody Bag. I find it to be a great size for all my necessities with far more security than I have ever needed.\n\n![](/content/images/2017/08/randiBag-small.jpg)\n\nThere you have it. All of my items (sans passport and credit cards) for three weeks in Europe, all packed into a 10-pound, 21-liter pack. I'm really excited to give minimal travel a go. More to come upon our return.\n\nIf you would like any details on the price, brands, or experiences regarding any of my items please feel free to reach out via [email](mailto:travelsaveandbemerry@gmail.com). Thanks for reading.\n",
  "description": "Packing lite can be hard, here is Randis 2017 list!",
  "tag": [
    "Packing"
  ],
  "author": [
    "Randi"
  ],
  "thumbnail": "/images/Randiclothing-small.jpg"
}