{
  "date": "2017-03-27T18:47:00.000Z",
  "title": "A correction is coming",
  "body": "\n\nI was recently talking to an older relative who had mentioned that he had pulled all of his money out of the stock market to prepare for a correction. I, like most index investors, turned my nose up a bit, but why? I think most people who invest heavily in index funds feel that time in the market is more valuable then timing the market. Also they follow very heavily to the teachings of Jack Boggle, that its impossible to time the market well.\n\n> “After nearly 50 years in this business, I do not know of anybody who has done it successfully and consistently. I don’t even know of anybody who knows anybody who has done it successfully and consistently.” - John \"Jack\" Bogle\n\nThis idea isn't unique to Bogle, and his gang of Bogleheads. The famous money manager Peter Lynch seems to have a similar stance.\n\n> \"I can't recall ever once having seen the name of a market timer on Forbes' annual list of the richest people in the world. If it were truly possible to predict corrections, you'd think somebody would have made billions by doing it.\" - Peter Lynch\n\nDespite this time tested, and popularly endorsed advice, the emotional and logical part of our brain is constantly telling us what we all know to be true \"A CORRECTION IS COMING\". We know our current rally wont last for ever, and we know there will eventually be a drop. So why be judgmental of someone following their plan?\n\nWhat is an index investor to do knowing a correction is coming?!\n\nSell everything and invest in bonds? Gold? Cash or money market? Problem is we don't know WHEN it is coming, just that it is coming. So any reallocation from our normally strategy is historically, and statistically and inferior move.\n\n> \"Far more money has been lost by investors preparing for corrections, or trying to anticipate corrections, than has been lost in corrections themselves.\" -Peter Lynch\n\nSo what is left to do? In a bull market when you feel a correction is coming, here are some recommendations:\n\n* Get out of debt - Reducing your debt burden in times of prosperity will reduce your required expenses in times of shrinkage or stagnation.\n* Adjust employment - If you can, switch jobs, seek promotions, or get raises now is the time. Skilled human capital is valued highest when people have opportunities to switch jobs.\n* Don't adjust your asset allocation! - It is extremely tempting to say \"I want to reduce my equities, and increase my bonds or cash\" but remember, you don't know WHEN the floor will fall out, so you may be stuck in bonds for longer then expected if the market keeps going up.\n* Keep spending in check - It's very tempting to let your lifestyle creep up during these times, remember every dollar you add to your life style now will be a dollar you need to earn when jobs are hard to find, and values of everything around you has dropped.",
  "description": "A correction is always on the way. This is a reminder to myself to take advantage of good times!",
  "thumbnail": "/imgs/squawpass1.jpg",
  "author": [
    "Tyler"
  ],
  "tag": [
    "Money"
  ]
}