{
  "date": "2017-01-28T18:25:00.000Z",
  "title": "Dalmatian Coast for the Frugal Traveler",
  "description": "My 2015 trip to Croatia was everything I hoped it could be!",
  "author": [
    "Randi"
  ],
  "tag": [
    "Croatia",
    "Europe"
  ],
  "body": "I've read that Croatia is the poor man's Italy...well, I might re-frame that...Croatia is the frugal travelers dream getaway. \n\n![Dubrovnik, as seen from above. You can take the cable car up for ~$12 USD...you can also walk up for free!](/images/p5280071.jpg)\n\nIn May 2015, I traveled to Croatia and fell in love with the country and the Adriatic. It took a bit more research than an Italian adventure (as the resources were not quite as plentiful), but in the end I found the Dalmatian Coast to have the most beautiful views, fabulous wines, and amazing seafood...all for 1/4th the cost of Italy. While you can find Groupon deals and other packaged tours for nearly every destination (Croatia included), in my experiences the more work you put into a trip, the cheaper you can get the cost...and I am all about finding ways to travel, save, and be merry.\n\n**Destination and Cost** \n\nThere is no shortage of amazing destinations in Croatia.  I settled on the southern region, known as the Dalmatian Coast. Due to the limited timing, this made the most logistical sense. The trip was a total of 15 days, including travel time, and included **Split (including Krka National Park), Havr, Korčula, Dubrovnik (including Elaphiti Island and Ston)**...also a very bizarre 24-hour layover in Oslo, Norway. I go into the travel details in [this post](http://travelsaveandbemerry.com/croatia-dalmatia-region-plan-your-own-adventure-2/), but for this post I focus on the $$.\n\n![Total cost of my 15-day Dalmatian experience](/images/croatiacost.png)\n\nI expected the cost to be about $1k more than what was actually spent. Here is how I did it:\n\n***Flight -*** This proved to be the most challenging (and they only way in which Italy is actually cheaper).  Flying into Croatia from the US is not an easy or affordable task. After months of research, I found a NYC to Split flight with a 1-stop layover in Oslo, Norway for $881.38; unfortunately, that seemed to a good deal for a Croatia flight. Given that I was flying from Denver, I also had to get a round trip flight to NYC, which I did for $236.20. \n\n***Accommodations -*** Throughout the rest of the trip I used Airbnb to find studio apartments in each city.  I love this option for travel in Europe as it is very easy to find an accommodation with a kitchen, thus creating the ability to cook a few meals and cut down on costs! Use this link to get $40 off an [Airbnb reservation](https://www.airbnb.com/c/rbretz) if you are new to the site.  Our Airbnb locations were in ideal spots for easy walking to city centers and public transit. **Average nightly cost was $58.47**; which includes a $117 night in an NYC hotel on the return trip. This cost was shared with my friend, so my cost was only $29.23/per night. There was an unexpected change in our flight times that resulted in a 24-hour layover in Oslo, which is a *very* expensive location; luckily I spent many hours on the phone with the airlines costumer service and got this room comped. Thus night #1 was at no cost.\n\n*Remaining cost -* While I did mix up the money spent on food, wine, and activities (terrible blogging practice, I know); the remaining dollars spent totaled $999.96. \n\n***Food -*** I found eating out in Croatia to be affordable as long as you attempt to find the off-the-main-strip locations and be sure to note that fish is often sold by the kilo (which caught us one night with when a server showed us a wonderful looking fish, turned out to be a $110 meal for two...oops, lesson learned). Cappuccinos are around $1.50 USD for a small and $3 USD for a large. Wine is cheaper than soda if you select the house offerings. Beer (or Piva) was also very affordable, around $1-3 USD for a light beer depending on the location. Seafood was in no short supply (thank goodness!) with crustaceans (muscles, clams, shrimp) being a amazing and surprisingly affordable.\n\n![Seafood spaghetti found at a random restaurant at a very small town, called Milna; biked there out of Hvar.](/images/croatia-food.jpg)\n\nI cooked most breakfasts in the room (a soft boiled egg with toast and fruit). It was also fun to cook dinner 3 or so nights throughout the trip with items picked up a the local market (always with wine and olive oil). Truffles and olive oil are a specialty in Croatia. We found truffle raviolis at nearly every grocery, which we paired with some veggies (zucchini or leak), bread with olive oil, and wine (naturally).\n\n![Perfect home cooked dinner before a night out.](/images/croatia-food2.jpg)\n\nPizza is also amazing in Croatia and quite affordable. About $20 for a seafood pizza and two glasses of wine.  Or $3.25 for a slice of pizza and a beer.\n\n![Small pizza and sandwich shop right by the port in Split.](/images/croatia-food3.jpg)\n\nAnother great cost saver is picnic lunches. There were several days we would find a grocery and just grab whatever looked good. Here we are in a small town, Lumbarda, on a Korčula Island with bread, olives, cubes of some amazing hard cheese, prosciutto, and, of course, wine. \n\n![The astounding Adriatic water was the most amazing backdrop for our midday picnic.](/images/croatia-food4.jpg)\n\n***Travel -*** Ferries were also surprising affordable. The Split to Hvar ferry was \\~40 HRK, Korcula to Dubrovnik ferry \\~110 HRK, bus from Dubrovnik to Split ~$20 USD. Far cheaper than the 60 Euro train rides in Italy. \n\n***Entertainment -*** We found a number of activities that offered us an unforgettable experience, but ultimately, was not absurd in cost. For example....\n\nIn Hvar: Renting bikes for the day (about $18 each) to bike around the island and and find secluded beaches. \n\n![Dubovica Beach was deserted and so beautiful...very romantic.](/images/croatia-rock-beach.jpg)\n\nIn Hvar: Hired a motor boat (without a skipper) and sail out to the several small beaches on the archipelagos off the coast of Hvar.  Our favorite was Palmizana beach (on one of the Pakleni Islands).  I believe the boat rental was about $40 for the day.\n\n![The water at every beach was so breath-taking!](/images/croatia-water.jpg)\n\nKorčula: Again rented bikes (about $12/day) and biked to a fabulous little seaside town called Lumbarda (about 4 miles).  Lumbarda has several beaches and wineries.\n\n![Beach Vela Pržina in Lumbarda...a short bike ride from Korčula.](/images/IMG_0184.JPG)\n\nDubrovnik, Elafiti Island boat tour with lunch included was a more expensive tour a well worth it. The trip goes to Lopud, Sipan, and Kolocep Islands.  The cruise also includes a full lunch of grilled fish, salads, and wine!  I believe we paid about $60 each. You can find people selling this tour all around Old Town. At most Croatian beaches, you can expect to pay for chairs and umbrellas. In many instances we simply asked if we buy a drink or food will they wave this fee; in nearly every instance they did. That being said, on this tour booze was included, so we didn't feel the need to spend more money on beverages, so we just lounged in the sand and it was wonderful.   \n\n![A sign spotted by the beach in Lopud.](/images/croatia-sign.jpg)\n\nSimilarly, there are people selling kayak tours everywhere in Dubrovnik. A sea kayaking tour around Lokrum Island offered a unique view of Old Town from the water and a trip to Betina Beach (which is only accessible by water).  This trip was around $35 and was our favorite Dubrovnik activity.  \n\n![A blurry pic of Betina Beach.](/images/croatia-boat.jpg)\n\nIn Split we really only had 1 full day.  Plitvice Lakes National Park seemed a bit too far away, so we opted for Krka National Park.  We were not disappointed.  We booked with small, self-started, tourism company Dream Transfers and Excursions, run by Petar (http://www.transfers-excursions-trogir.com/). Here is the link to his [Trip Adviser reviews](http://www.tripadvisor.com/Attraction_Review-g1572411-d6745484-Reviews-Dream_Transfers_and_Excursions-Seget_Vranjica_Split_Dalmatia_County_Dalmatia.html).  We booked the Unique NP Krka tour which included transfers, Krka entrance, and wine tasting in a small hilltop town all for 450 Kuna (~$65 USD).  It was truly a perfect day!!! \n\n![Krka National Park.](/images/croatia-krka.jpg)\n\nThat is a summary of the costs of my trip.  I'm happy to answer specific questions about costs or planning of the trip (travelsaveandbemerry@gmail.com).",
  "thumbnail": "/images/p5280071.jpg"
}