{
  "date": "2019-07-21T16:37:00.000Z",
  "body": "We were lucky enough to spend a long weekend woth some great friends backpacking into\n\n### Drive in\n\nThe drive to the upper trail head wasnt impassibpe for stock SUVs but I would have probably not taken a small car up there. We took a CR-V and RAV4 up, there must have been some small critters on the ground because some funny sounds came from under the car, could have also been bouncing off rocks, but I am going to go with a gang of marmots punching the frame. It is probably better to walk from the lower trail head, but we are lazy and had a sheadule to keep!\n\n### upper trail head\n\nThe upper trail head has a few camp sites, running water near by, a trail log/sign-in and a few maps/signs. Like most Colorado trail heads parking was limited, and people were parked 1/2 way to the lower head by the time we left, so if you want a good spot come early! We called the park rangers office and they said human waste was getting out of control so they claimed to have dookie bags, but when we got to the cooler where they would he stored it was empty... so either they got used, or that marmot gang stole them, those trouble makers.\n\n### Hike to lakes\n\n((first day map))\n\nThe initial hike up wasn't to long, it did have a bit of elevation gain and I am getting fat, so I am sure I complained like the perverbial baby who is constantly getting his candy taking. There is a trail split 3/4 of the way to the lakes where the camping starts, it seems like some of the camping spots are amazing, but most of them are right off the trail with tons of foot traffic. So if you see a private spot I recomend taking it while its still there. We passed a few locations with running water and considered filling up blatters there, but between the lakes are several spots to grab water for filtering and so no need to carry the extra weight up. Unless you arent lazy like me, then grab some of those rocks on the way up. get some of those #gains.\n\n### crestone\n\n((crestone map))\n\nour original plan was to do crestone first, back track to broken hand pass then do crestone needle from the standard route. but you know... weather...\n\n### humbolt\n\n### crestone needle\n\nta\n",
  "tag": [
    "Colorado",
    "Colorado Hiking",
    "14ers"
  ],
  "author": [
    "Tyler"
  ],
  "thumbnail": "/imgs/aboutus.jpeg",
  "description": "THIS NEEDS WORK",
  "title": "South Colony Lakes"
}