{
  "date": "2021-04-06T16:39:39.066Z",
  "title": "Taking a sebatical",
  "body": "I am calling it a break. In April 2020 I am starting my Sabbatical. I am taking 3 months off work, with the potential to quit and take additional time off if I need to.\n\n#### Why?\n\n* **I want to.** The quality of work I have been delivering was not up to my personal standards. I was able to complete tasks with a reasonable degree of quality, but it needed to have a deadline and I wasn't going above and beyond on any of it.\n* **I can**. We saved enough money leading up to this that I think we are in an okay spot to not work for a bit.\n* **Travel.** We have taken a few vacations over the years, but always with the background idea that our lives exist away from the experience that I was taking. It was always a nagging feeling that in order to appreciate something it needed to be with out the idea that I am going back to work in 2 weeks I need to make the most of this expirience.\n\n#### Hopes:\n\n* **Digital Nomad** - I have long desired to travel more and try working from different places around the world. My hope is that I can take some sebatical time to skill up on a few things I want to be doing then pivot side projects to fall inline with that.\n* **Learn** - I have let my career drift into the space of what I am good at, not what I want to be doing. I would like to take a step back and figure out what I want, then strive to become good at that thing.\n* **Un-burn out** - I have felt so burnt out lately, I can focus when it is time sensitive, or for short periods of times... but if it isn't time sensitive, and it requires long term dedication it wouldn't happen.\n\n#### Fears:\n\n* **Losing traction in my career** - Gap on resume, tech scene will pass by, I will be viewed as flighty\n* **Returning to a bad economical situation** - We haven't experienced a real depression\n* **Having to eat into savings** - FIRE dream might be dead, but we don't want to dig into 401k or Trad IRA in order to survive.",
  "description": "Why Tyler isn't going to work for a bit.",
  "tag": [
    "Money"
  ],
  "author": [
    "Tyler"
  ],
  "thumbnail": "/imgs/aboutus.jpeg"
}