{
  "date": "2018-06-26T14:17:00.000Z",
  "body": "After cramming Oxford/Belford into one looong and painful day in 2012, we elected to complete Missouri Mountain as an overnight backpack trek...and we regret nothing.\n\nQuick Stats:\n\n###### From trail head to campsite\n\nSaturday, July 8, 2017 2:31 PM MDT\n\nDistance: 1.7 miles\n\nDuration: 1 hours, 42 minutes, and 8 seconds\n\nAverage Speed: 1.0 mph\n\nMinimum Elevation: 9577 feet\n\nMaximum Elevation: 11260 feet\n\nTotal climb: 1683 feet\n\nTotal descent: 56 feet\n![The hike to the campsite was a pretty aggressive uphill with our full camping setup](/content/images/2017/08/Hike-to-campsite.png)\n\n###### From campsite to summit to trailhead\n\nSunday, July 9, 2017 6:36 AM MDT\n\nDistance: 9.2 miles\n\nDuration: 9 hours, 9 minutes, and 4 seconds\n\nAverage Speed: 1.0 mph\n\nMinimum Elevation: 9621 feet\n\nMaximum Elevation: 14040 feet\n\nTotal climb: 3547 feet\n\nTotal descent: 5229 feet\n\n![Randi, Andrew, and Marley at the trailhead bags packed!](/content/images/2018/06/Missouri1.jpeg)\n\nMissouri, Belford, and Oxford can all be completed from the Missouri Gulch trailhead. After ~2.25 miles from the trailhead the trail splits with Missouri to the right and Belford/Oxford to the left.\n\n![The trail starts off with a lovely trek through an aspen grove.](/content/images/2018/06/Missouri2.jpeg)\n\nThere is a great campsite right around 1.75 miles in, before you exit the trees. The campsite has a great snowmelt stream running about a quarter-mile away. This enables a hiker to get a good 1,500+ elevation gain out of the way before attempting either 14er trek...absolutely ideal!\n\n![Picture perfect camp spot.](/content/images/2018/06/Missouri3.jpeg)\n\nAfter the steep (but short), uphill trek into camp we enjoyed a relaxing evening in preparation for tomorrow's climb.\n\n![Red beans and rice with chopped up summer sausage and parmesan cheese.](/content/images/2018/06/Missouri4.jpeg)\n\nThe next morning was an early start with amazing weather ahead of us.\n\n![Andrew and Randi start off with Missouri dead ahead.](/content/images/2018/06/Missouri5.jpeg)\n\nThe morning warms up fast as we come out of treeline. Even in early July, plenty of snowfields were crossed.\n\n![Marley leading our crew up and up and up.](/content/images/2018/06/Missouri6.jpeg)\n\nMarley (Andrew's pup) was a trooper, but the rocks seemed to bother his paws near the summit. May not be an ideal hike for puppers who do not have high-altitude experience.\n\n![Near the summit, the only technical part of this trek.](/content/images/2018/06/Missouri7.jpeg)\n\n![Traditional summit pic.](/content/images/2018/06/Missouri8.jpeg)\n\nBack down at camp, time to pack-up and pack-out!\n\n![Cleaning up our campisite](/content/images/2018/06/Missouri9.jpeg)\n\n![Marley is wiped out...but we still have 1.7 miles to descend.](/content/images/2018/06/Missouri10.jpeg)\n\nAll in all, hiking in and camping was far preferred to completing the full hike in one day. Plus, Tyler fair preferred the tolerable 6am wake-up call compared to 3am...but he is a bit of a whiner about mornings.\n",
  "title": "Missouri Mountain",
  "description": "Enjoyable as an overnite trip for sure",
  "thumbnail": "/imgs/Missouri4.jpeg",
  "tag": [
    "Colorado Hiking",
    "Camping",
    "14ers"
  ],
  "author": [
    "Tyler"
  ]
}