{
  "date": "2017-08-19T14:08:00.000Z",
  "body": "##### BACKBACK(s)\n\nOn this trip we are planning on doing a bit of hiking so we are going to try bringing an extra pack, we will see how it goes, and if it is even necessary. The thought is that it will be useful in situations where there is a high probability of the pack getting wet. A soaked pack would be devastating for the topo bag I have. I also have 3 Amazon basics packing cubes I use to keep things organized since the topo bag is pretty much one large pocket.\n\n![Topo dayback, might be a few generations old at this point](/content/images/2017/08/tylerbackpack-small-1.jpeg)\n\n![Small flash backpack that we use for hikes or situations where things need to stay dry, like kayaking](/content/images/2017/08/tylerflash-small.jpeg)\n\n##### Outer layers\n\nMy father-in-law gave me this rain jacket, I think he found it at a bus stop. It does a good job keeping water away and has some warmth to it. My other rain jackets are a bit smaller, yet still, manage to weigh more and don't have a hood. This jacket is also a little bit larger then I need... so like a crazy person I will use it to shield my backpack from the rain. I look like [a ninja turtle wearing a trench coat](https://i.pinimg.com/236x/dc/a5/cc/dca5cc673209f2c920d8b2ee7644a2ef--ninja-turtle-raphael-guide-book.jpg), but its effective.\n\n![Columbia Rain Jacket](/content/images/2017/08/tylerrainjacket-small.jpeg)\n\n**Button-up ExOfficio** - This shirt does a good job not smelling and drys pretty quickly for its warmth. If things ever get cold I normal put on an undershirt, a long sleeve, this buttonup, and my rain jacket. So far I haven't had any problems.\n\n![](/content/images/2017/08/tylerbuttonup-small.jpg)\n\n##### Leg accessories\n\nI have a few pairs of **hiking pants**, that I think are passable as slacks if I can manage to sneak all the wrinkles... but who are we kidding, I am not going anywhere fancy enough to need slacks, and I am DEF not getting the wrinkles out of my pants.\n\n![Columbia Pants](/content/images/2017/08/tylerpants-small.jpeg)\n\n**Traveling shorts** - I believe these are REI brand, I have had a few pairs over the years, I normally wear them 6 days a week and drive them into the ground like a plane with out plane that just had its wings ripped off. I also bring a pair of **Puma running shorts**. I use them on laundry days, or for swimming. They dry fast, weight little, and pack small.\n\n![My shorts! a pair of puma running shorts and an REI pair of hiking shorts.](/content/images/2017/08/tylershorts-small.jpg)\n\n##### Shirts and under bits.\n\nI am bringing **four pairs of ExOfficio briefs**, they are comfy, dry really fast, and have the sweet light/small combo. I am bringing **three cotton t-shirts** because I like cotton, bucking the trend. I might change my mind later, but I am currently satisfied with it. I also take 1 synthetic shirt for days when I KNOW I will be sweating up a storm.\n\n![My shirts and underwear](/content/images/2017/08/tylershirts-small.jpg)\n\nI have a **long sleeve ExOffico** shirt that is great for when I need just a bit more warmth or sun protection.\n\n![](/content/images/2017/08/tylerlongsleeve-small.jpg)\n\n##### Footies\n\n- **Asics street shoe** (1 pair of smartwool socks)\n- **Earth runner sandals** - These are my main footwear if the weather will allow it.\n\n  ![My footwear](/content/images/2017/08/tylershoes-small.jpg)\n\n##### Little Bits\n\n- GoPro + SD cards. We don't do a bunch of photography out side of our phones, but it can be nice to have the GoPro for water activities, or for when we keep the phones in our rooms.\n- Google pixel + charger - This has been my go to the phone since it came out, the camera works well, [GoogleFi](https://g.co/fi/r/5153F2) has been an absolute dream for international travel. Most of the time it works as easily as it does here in Denver.\n- Toothbrush + paste\n- USB wall chargers - Since we aren't bringing computers on this trip we are just taking a few USB wall chargers.\n- Portable Bluetooth speaker (not shown) + charging cable\n- Sunscreen\n- Passport\n- Notebook\n- Emergen-C (helps with funky tasting water)\n- Sunglasses\n- Tissues\n- Headlamp - we are hiking a bit in caves and is useful for night time reading and stuff.\n\n  ![Some of my small things I take on a trip](/content/images/2017/08/tylersmallbits-small.jpg)\n\n- Roll up water bottle.\n\n  ![Packs small, yet still hold shape](/content/images/2017/08/2017-08-18-17.46.16.jpg)\n\n- **sham-wow** - I use this for drying clothes (roll up technique), and drying off after swimming, it works well at getting most of the water off, but you still won't feel \"dry\"... just not wet.\n- **Fold up REI hat**\n\n  ![Fold up hat helps with sweat and sun](/content/images/2017/08/Tylerfolduphat-small.jpg)\n",
  "title": "Packing (Lite) List - for him",
  "description": "Packing light can be hard, here is Tylers 2017 list",
  "tag": [
    "Packing"
  ],
  "author": [
    "Tyler"
  ],
  "thumbnail": "/images/tylersmallbits-small.jpg"
}