{
  "date": "2022-03-04T15:55:42.215Z",
  "updatedDate": "2022-03-04T15:55:42.232Z",
  "title": "San Cristóbal de las Casas",
  "body": "Our Feb 2022 home was in the beautiful town of San Cristobal de las Casas. The name is absolutely a mouth full so I think the more common name is San Cris, so that is what you will hear me referring to it moving forward. Immediately entering San Cris the elevation reminded us of home. The main part of the town is 2200 meters or 7200 feet, but there are a few churches on ends of the city that are up on hills that go up even higher! The churches on the hill are a great place to watch the sunset! I hear they are also good for sunrises, but I wouldn’t know about that 💤. We stayed in a small garden apartment behind some ones house for the month.\n\nDuring the month we tried a few different foods and went back to some of our favorites. Randi learned how to make salsa verda which we used to make chilaquiles. She also made a new type of soup called pork pozole verde. We also a few different kinds of smoked meat like ribs, and brisket which are pretty popular in the area. As far as deserts and late night foods we went with classics like a esquite, churros, and cake. We also tried a donut type treat that was always around in the market near our house. A favorite desert may have been having donuts on a rooftop over looking the city though. You can have desert at noon right? \n\nWhile we were there it had some time being cold and rainy, but we enjoyed the sunny days when we had them and hiked up the neighboring peaks to look down on the city. It was great to do hike in nature again, this was a hobby we previously enjoyed, but with Randi’s CO Trail injury we have been touch and go for a few years. So it was nice to get a few dozen pain free miles in. Check out the pictures to see some of the hikes and caves we explored while we were there!\n\nThere was a movie theater in San Cris, which we went to on the rainy days. One of the things they showed in the theater was the Superbowl which was a new experience for us. Guess that sets our personal experience for biggest TV to watch sports ball on.\n\n[](https://photos.app.goo.gl/vdP9GuBytyMppZgw5)<https://photos.app.goo.gl/vdP9GuBytyMppZgw5>",
  "description": "We spent the month of February 2022 in a high elevation town called San Cristobal de las Casas.",
  "thumbnail": "/images/sancris1.jpg",
  "tag": [
    "Mexico"
  ],
  "author": [
    "Tyler"
  ]
}