{
  "date": "2022-02-05T15:39:34.361Z",
  "updatedDate": "2022-02-05T15:39:34.380Z",
  "body": "Sorry for a bit longer of break between posts! We have had a few stops between my last posting. So get ready to speed run two months of life!\n\nRandi's work had a party and was willing to fly her to Denver for it. We took that opportunity to visit some family and friends, but sadly couldn’t fit everyone in. It was great talking to the friends we did see though! We spent most of our time with family, but we did sneak away to see some friends including a broncos game! Randi was still working during this time, and I was just starting my new job as a contractor for a UX agency. Luckily when we are in town Randi's Grandpa and Grandmother let us borrow their truck! It is an old Ford Ranger and is real hoot to drive around. It is manual transmission, and no power steering so the lack of heat isn't an issue for the small cabin, a few turns and you are pulling off your winter jacket. The rear wheel drive can require a bit of focus in the snow but it sure is fun! We were able to stay in Denver for just over two weeks.\n\nAfter Denver we went to NC to visit my family. We got to see all but one of my siblings during our 3 weeks there! Grant wasn't around due to teaching English in Korea. Despite him being on the other side of the  world we got to play video games with once. While we were there we did our gift exchange, and celebrated Christmas (Which we hadn’t done in person since 2016). Randi got Emily in secret sibling and Emily made a cool scavenger hunt that goes around the town of Fuquay-Varina, North Carolina. The real highlight of that trip was spending time with family including a niece and a nephew who live in FV and Winston Salem! In the world of touristy things, we went to the NC history museum and learning about the Pirates!\n\nWith our NC goodbyes behind us we flew back to Denver for another two weeks. We ended up spending most of our time with family. I have a long list of people I sadly didn’t get to see last time we were there and will be starting with next time we are in town! This time to Denver we celebrated Christmas (even if it was a bit late) with Randi’s family and spent a bunch of time playing games! Randi wasn’t working this time in Denver so it was her turn to spend time with friends as I worked a few more hours during the day! Randi’s Mom and her husband Joe said they wanted to come visit Mexico but its hard to make plans in early 2022! We have been looking at fun places for the four of us to go and keeping an eye on what is open!\n\n## NOW for CDMX!\n\nThis was our second stint in Mexico city. We were here for two weeks this time. It was every bit as interesting as the first time. Every street we turn down has new food to try, and new sites to see. We stayed in the same location, so we didn’t have to relearn our block, but other then that, a lot felt new.\n\nDuring the weeks I was working, but our nights and weekends have been occupied by exploring the city. For our first Saturday here we enjoyed a walk to the large park again, but on the way stopped for for a few yummy street food treats!\n\nOur favorite foods we had were Gorditas, Barbacoa Tacos, and our new drink we to hunt down is Atole. Both were made by street venders. We are learning you need to take advantage of when something smells good and go for it. In CDMX, we found Barbacoa only around on weekends when it is on every 5th corner. During the week however it is no where to be seen. Atole is a corn based drink, we had ours with chocolate, so it was similar to chocolate milk. Atole can have a variety of thicknesses but this one was really smooth and creamy!\n\nThe gordita and floutas made by a cute family. They were amazing! The meat was cooked on a flattop grill with a large indent on one side where all the juices flowed into. We also had these little pancakey guys with carmel on the inside. Despite being told 10 times what they are called best I can do is “pancakey guys”.\n\nOur big failure/learning opportunity of the trip was trying to see an Opera at their giant play house. So we went and bought tickets, the tickets were unrealistically affordable. As we were waiting for the show we were talking through how it was feasible to do a show at that price. But within 5 minutes till show time we figured out it was actually a live video stream from the Met in NYC. Learning Spanish as we are going has some confusion points. Despite it being a live video feed instead of a show it was still enjoyable. It was weird hearing the actors singing in English/French while we were in a country that spoke Spanish.\n\nWe got to see a few more museums and they were all pretty interesting! \n\nNext stop on our journey is **San Cristóbal de las Casas**!\n\n( Photo album https://photos.app.goo.gl/8NNW4uvdVMt8R6GC7 as always, if you are in a photo or article and don't want your face/story circulating the internet let me know and I will remove the photo or that section of the blog )",
  "thumbnail": "/images/co-nc-mx.jpg",
  "title": "Mexico City Part Two (and a little NC and Denver)",
  "description": "From CDMX to Denver to NC and back again! Our travels take us home and back out and about!",
  "tag": [
    "Mexico"
  ],
  "author": [
    "Tyler"
  ]
}