{
  "date": "2022-04-11T23:13:51.567Z",
  "updatedDate": "2022-04-11T23:13:51.587Z",
  "title": "Puebla",
  "description": "March 2022 in Puebla!",
  "tag": [
    "Mexico"
  ],
  "author": [
    "Tyler"
  ],
  "body": "(I am trying to write in different prompts. this one is trying to be first person present tense. If you are just here for the photos check out [](https://photos.app.goo.gl/xU6hqz9wffbpkpiT6)<https://photos.app.goo.gl/xU6hqz9wffbpkpiT6>)\n\nI look out the window of our plane arriving into Mexico City (aka CDMX) from San Cristobal I take in the sprawling CDMX cityscape. The quantity of people who can live in one large blob always seems to blow my mind. During our flight I talked to a member of the Mexican military on his way to a meeting in the city. He gives us recommendations on foods, movies, and tv shows. As he takes the conversation to American football, peaky blinders, and F1, I am face to face that yes, there are a ton of people on earth but we all work our way into shared interests and hobbies. One of his food recommendations is his favorite places to grab wings called Wing’s Army. As the plane makes its way to the ground it feels good to be warm and in a big city again.\n\nMy Spanish is still garbage, so I mostly recognize illustrations and context clues. Landing in the CDMX airport, I follow the bus illustrations to the bus ticket sales center in the airport. Our experience with buses where you buy tickets have all been pretty good, so we indiscriminately choose the next bus headed to the city of Puebla. boy did we get lucky this time. One dubbed Spider-Man: Into the Spider-Verse and ~3 hours later (in which I got to enjoy via a lazyboy-like bus seat) we arrive in Puebla. The smells of street food and the sounds of street venders fill the night air. We walk the 1 hour to our apartment for the next month. Finally home.\n\nAfter hearing for weeks about how good the mole was in Mexico we knew we had a mission for our first week there. As I worked Randi journeyed out to find some.\n\n> *Randi:* After some quick google searching I walked out the door with hopes, dreams, and a pocket full of pesos. Walking down our street to the sounds of dogs barking I made my way to a small shop called Lupitas Moles. Stepping through the door way I enter a space that was probably a living room at one time but is now a small store front. I am immediately greeted by a younger women who is happily talking to me in a language I am only picking up every other word. We talk about how to make the mole, what to put it on, what kinds are her favorites. Eventually I walk out the door with 5 different kinds of mole and a task for the evening!\n\n![Mole Party](/images/puebla-mole.jpg \"Mole Party!\")\n\n*Back to Tyler:* During the work we normally hang out at home, go on walks around the park and save bigger adventures for the weekend! Today is our first Saturday of checking out the city! As we stroll to the downtown part of the city we let our nose take notes of all the places we would like to stop during our time here. Upon arrival to our first stop of the day, the cultural history museum, we are asked where we are from, but instead of saying “**De dónde eres**” we are asked “**En dónde vives**” which neither Randi or I understand, so we started our “live action drama” called “silly lost tourist”. Language is hard. After taking in the modern art we walked through a hallway to the next exhibit. Over our shoulder we saw the piece we had been looking for our whole trip. It was a timeline spanning from ~4000BC to present day. Several major regions of the earth had a horizontal line so you could compare what types of art, science, and engineering different parts of the world were coming up with about the same time.\n\n![Time line of different events from around the world (and Randi pointing at one from Colorado!)](/images/puebla-timeline.jpg \"Time line of different events from around the world (and Randi pointing at one from Colorado!)\")\n\n\n\nOur journey around the city had two more minor stops before we headed home to finish the TV series Drive to Survive. Alcohol and sugar. Calle de Los Dulces is a small street focused on candy shops. Most of them were the pretty much the same, but a few had some very unique foods like chocolate covered crickets, and sweet potato candy! As for the alcohol we had Pasita, a raisin based liquor!\n\n![Pasita is a grape/raisin based alcohol popular to Puebla](/images/puebla-pasita.jpg \"Pasita is a grape/raisin based alcohol popular to Puebla\")\n\nIn Puebla we also journeyed out to two pueblos magicos. Cholula & Atlixco. Both of which were so pretty. Amazing views, interesting sites, and delicious food. We did eat at the recommendation of Wing’s Army, it was absolutely as good as our fellow plane traveler made it out to be.\n\n\n\nVery close to our home for the month were underground tunnels the military used to resupply during invasions.\n\nA few other things of note.\n\n* We saw the “Smallest volcano in the world” but it was actually\n* After months of watching what all the mexicans do we finally worked up the courage to do it. Doing the most authentic thing we can. Getting a little ceasers pizza and eating it in the park.\n* Randi has more hip issues, but not letting it get in our way to much!\n* Oldest public library in the Americas [](https://en.wikipedia.org/wiki/Biblioteca_Palafoxiana)<https://en.wikipedia.org/wiki/Biblioteca_Palafoxiana>\n\n(here are the photos [](https://photos.app.goo.gl/xU6hqz9wffbpkpiT6)<https://photos.app.goo.gl/xU6hqz9wffbpkpiT6>)\n\nNotes from Randi!\n\n1. MOLE BAKEOFF!!! My favorite Mexico activity to date.\n2. King size bed\n3. Finding Colorado´s Mesa Verde in the Amparo Museum's Wall of Cultural Evolution\n\nLowlights:\n\n1. Dogs barking all night",
  "thumbnail": "/images/puebla-volcano.jpg"
}