{
  "date": "2023-02-13T15:08:02.006Z",
  "updatedDate": "2023-02-13T15:08:02.015Z",
  "body": "### Comino, Gozo, and Malta Hiking Adventures \n\nHi friends and family…we hope you are well. As our month in Malta comes to a close, we reflect on the things we learned and enjoyed about this historic island in the Mediterranean.  \n\nIf you are just here for the pics, check our our Malta Part II Photo Album: https://photos.app.goo.gl/9M3xRT89UBeeuRM5A\n\nA few things we learned: \n\n* Malta is made up of three islands, Comino, Gozo, and Malta (the main island).\n* Population of Malta is just over half a million, which is smaller than Denver.\n* Gozo is home to the Ġgantija temples, which are manmade temples 5,600 years old (older than the pyramids of Egypt), making them the world's second oldest existing manmade religious structures.\n* Fifty-seven degrees, with 70% humidity mean very different things depending on cloud cover, wind speeds, and/or sun-shining (some days felt quite a bit chilly, while others were gloriously warm).\n* European islands appropriately work to conserve water and do not have large hot-water tanks; thus, showers get cold fast in Malta (like 3 minutes tops).\n* Malta is an affordable and astounding country; rich in history, hiking, sea-side views, and local charm. \n\n![The Ġgantija Temples on Gozo, ~5600 years old](/images/malta3.jpg \"The Ġgantija Temples on Gozo, ~5600 years old\")\n\nA few things we enjoyed: \n\n* When the sun was shining, we took advantage of the warmth and hiked all around the three islands of Malta; Comino was stunningly gorgeous (see post cover photo), Gozo was packed with interesting history, Malta had so many trails all accessible by public transit....each island had fantastic hiking! \n* PASTIZZIS!!! These are filo-dough pastries, typically filled with ricotta cheese. At $0.50 a pop they are a wonderful snack and sold all over Malta.\n* Tyler rekindled his love of Shandy’s and Randi found cappuccinos with Amaretto to be the perfect mid-day pick-me-up.   \n\n![Pastizzis in Malta](/images/malta4.jpg \"Pastizzis in Malta\")\n\nOther updates: \n\n* Next up we head to Portugal to close out February. First a few days in Lisbon followed by Lagos (southern Portugal in the Algarve region) to hike parts of the Ruta Vicentina, a coastal thru-hike.  \n* We are now working to learn Turkish!! After Portugal we head to Turkey and we are a bit intimidated by the exotic and foreign culture, language, and customs. Gidelim! \n* Tyler is in the middle of a month without video games as his current challenge.\n* Randi has been spending hours studying locations and planning how we might spend our time during our travels in 2023.\n* We both highly recommend the new HBO show: The Last of Us\n\n![Tal-Mixta Cave above Ramla Beach on Gozo](/images/malta5.jpg \"Tal-Mixta Cave above Ramla Beach on Gozo\")\n\nAll in all, Malta was a delightful surprise that exceeded all expectations. We strongly recommend this Mediterranean country for anyone’s holiday destination!! As always, don’t be shy to text, call, or email us with your updates!",
  "title": "Malta Month of MERRY-ment - Part I",
  "description": "As our month in Malta comes to a close, we reflect on the things we learned and enjoyed about this historic island in the Mediterranean.  ",
  "thumbnail": "/images/malta2.jpg",
  "tag": [
    "Europe"
  ],
  "author": [
    "Randi"
  ]
}