{
  "date": "2023-04-19T06:37:00.740Z",
  "updatedDate": "2023-04-19T06:37:00.746Z",
  "thumbnail": "/images/turkiye2cover.jpg",
  "title": "Türkiye Part II: Cappadocia and Istanbul",
  "description": "Our travels in Cappadocia and Istanbul in spring 2023",
  "body": "# …which was once Constantinople (keep reading to learn why they changed it)\n\nWhere have we been lately?\n\nAfter one week in Cappadocia and two in Istanbul, our time in Türkiye has come to an end. Please enjoy our summary of this surprising country…or don’t, and skip right to the pics…your call. Overall, we were completely surprised by how much we really enjoyed Turkey. The people all over stood out as incredibly kind, welcoming, and genuine. Also, the food, hiking, and history kept us very entertained. We are already talking about when we might be able to return! \n\n[Here are the pictures of hiking around the unique geological formations of Cappadocia, along with the few pics we captured while exploring Istanbul](https://photos.app.goo.gl/JVdhM7pPaYFxjHUH8).\n\nCappadocia \n\nCappadocia is a region of central Turkey known for its distinctive “fairy chimneys” (cone-shaped rock formations), cave dwelling homes, numerous rock-carved churches, and several underground cities. It is hard to describe this region of Turkey; we had a bit of a bitter/sweet romance with Cappadocia. \n\n![Randi standing by stone pillars known in the Cappadocia](/images/turkiye2hike.jpg \"Randi standing by stone pillars known in the Cappadocia\")\n\nThe pros of Cappadocia: We were in awe as we hiked through the valleys and canyons exploring the by-gone era of cave dwellings and imagined what it must have been like living in the rock-carved homes. It was truly other-worldly. While we have enjoyed hiking in many of our locations, we typically have to take a bus for about an hour to get to a hiking trail; while in Cappadocia we enjoyed numerous hikes straight from our hotel room. We also met some astoundingly kind Afghan refugees who worked in the hotel and were kind enough to share a bit of their culture and life experiences, which gave us a profound introduction to the struggles of life in Afghanistan (we were grateful for the education; as well as the joy and humor they brought to every conversation). \n\nOur favorite activity was exploring the underground city of Kaymakli, a 300-meter deep city for local inhabitants for several centuries throughout the Arab-Byzantine wars. We could only explore the first 4 levels of this 13-level deep city. We had to crouch, squat, and duck as we made our way through the maze of tunnels exploring the different living spaces. It’s estimated that, at its peak, the population of Kaymakli grew to around 3,500 people. \n\n![Tyler in a cave](/images/turkiye2cave.jpg \"Tyler in a cave\")\n\nThe cons of Cappadocia: Due to the stunning photogenic atmosphere of Cappadocia, the region has been turned into a bit of a tourist Instagram hotbed. Over the last decade, the locals have been pushed out and all that remains in the center town of Gerome are hotels, restaurants, tourist offices, and tchotchke shops; this results in a very Disneyland-esque environment that looked like a real town, but also felt disingenuous. \n\nIstanbul\n\nIstanbul felt quite similar to New York City, in that it is a HUGE city, a tourist mecca, and each neighborhood had a slightly different feel and charm. The historic center is home to stunning mosques, The Grand Bizarre, museums, and endless tourist shops. The only mosque we visited was the most popular, Hagia Sophia, which has a fascinating history. In short, Hagia Sophia was originally an Eastern Orthodox church built in the 3rd century. After the Ottomans conquered Constantinople in 1453, it was converted to a mosque. It is still an active mosque today and free to enter (outside of Muslim prayer times).  \n\nWe thoroughly enjoyed strolling through the varying neighborhoods with a young Istanbul local Tyler met on Couchsurfing.com who offered to show us around his favorite charming streets and parks. He also invited us to his parent’s home for a traditional Turkish dinner (dinner table in pic below). Due to Ramadan (in which muslims fast from sun-up to sun-down), we could not begin eating until 7:45pm. The family was so kind and we greatly enjoyed learning more about their lives in Istanbul. This evening proved to be the highlight of our time in Istanbul. \n\nPhoto: <https://photos.app.goo.gl/bu8pTFGnybwhaCzB9> \n\nWe were warned that Istanbul is an annoyingly loud city; however, we must have lucked out, because we found our neighborhood to be quiet, peaceful, and very charming (that, or after the cities of Mexico every city appears quiet). We were delighted to continue to experience the astounding Turkish hospitality in the big city, where local cheese and baklava shop proprietors invited us to sit down for tea when they realized we were American and spoke English.  \n\nWe also enjoyed a ferry ride from one end of the Bosporus straight (Sea of Marmara) to the other (Black Sea). During which we were captivated by the incredibly large cargo-ships that passed through the straight. Tyler was very excited to spot a submarine making its way along the straight. \n\nPhoto (two photos…side by side please): \n\n<https://photos.app.goo.gl/VZ6uYhtE2VQctnsV8> \n\n<https://photos.app.goo.gl/E9RreS1f8c9hygBv7> \n\nOther interesting things of note in our world: \n\n* While one might think “çamaşır suyu” (literally translation: “laundry juice”) is turkish for laundry detergent, we are here to tell you that would be an unfortunate assumption…for as we learned the hard way, çamaşır suyu is bleach. \n* Baklava holds a secret ingredient that is not unlike crack-cocaine in its addictive properties…I will need an intensive detox period\n* Tyler has fully brought-into the romance of Turkish tea culture. Quote from him just this morning, “The Turks really do tea right…with the tulip cup and the little spoon, and the sugar cube…I didn’t realize everywhere else in the world does tea wrong until we learned about tea from the Turks.”\n* Friday we head to Slovakia to witness Dylan and Lenka’s civil wedding (the for-realsies wedding will be in September with friends and family…also in Bratislava). I’m so excited to attend and observe these two astounding humans join their lives together! \n* We get to enjoy May in Budapest as we dogsit with two little puppers in the city-center. \n* In 1930, the name of Constantinople was officially changed to Istanbul by Ataturk's government, which requested all countries to use Turkish names for their cities. The city's renaming was part of a broader effort to modernize Turkey and distance the country from its Ottoman past. Istanbul is the translation of the medieval Greek phrase “to the city”, which is what Constantinople was referred to for over 1000 years by the locals of the region (as it was the only major city in the vicinity).",
  "author": [
    "Randi"
  ],
  "tag": [
    "Europe"
  ]
}