{
  "date": "2023-01-28T08:50:13.640Z",
  "updatedDate": "2023-01-28T08:50:13.651Z",
  "title": " Malta Month of MERRY-ment",
  "body": "### (because everyone loves alliteration)\n\n\n\nHello friends and family from the Mediterranean!! After a wonderful holiday season, including a month with Tyler’s family in North Carolina and a month with my family in Colorado, Tyler and I are back out on our own and continuing to slow-travel. So far, 2023 is looking like the year of Europe. \n\n\n\nIf you are just here for the pics, check our our Malta Photo Album: <https://photos.app.goo.gl/MvkzpK86B2KBaWbs7> \n\nWe begin with Malta - a small island country south of Italy in the middle of the Mediterranean Sea. While we are only mid-way through our month-long stay and so far we are quite enamored with Malta. We are staying in a lovely one-bedroom apartment, blocks from the coastal boardwalk, with plenty of grocery markets, restaurants, and cafes. So far, we have been particularly impressed with ease of public transit (very easy to access hiking trails and other hamlets on the island), the affordability (groceries appear cheaper than Denver prices…though sadly I have not seen an Aldi’s), and the general ease of navigating all the things (due to English as a national language). It has been a fun mental disconnect to walk through very foreign streets, with very European architecture, only to pop into a shop and have the clerk greet me with English. \n\n\n\nAnother lovely quality is the plethora of history in every direction. Malta has been at the center of civilization for centuries and seems to pop up in all manner of historic events from The Crusades, to 16th century Ottoman interest, through WWI, WWII, and even the Suez Canal Crisis. Thankfully, Malta has some top-notch museums (namely the National War Museum) which walk through this country's fascinating history.  \n\n\n\nAside from enjoying all Malta has to offer, we’ve also enjoyed a good deal of relaxation and chill-time. A month's stay allows us to enjoy rainy days indoors without feeling rushed to see all the sights. The weather, while much warmer than Denver, has been about 50% rainy days and 50% sunny. Each day is a high of about 57-65 degrees, which feels amazing in the sun…and a bit chilly in the wind or rain. We feel relaxed and grateful for all the time we still have in front of us. Tyler has been enjoying some recovery time from working, finding a reinvigorated joy for a game called Factorio. I’ve been doing a good deal of cooking, researching sight/hikes on Malta, and beginning to research future travel adventures. \n\n\n\nWhile we are still seeing Malta through thick, rose-colored glasses, we have found it to be a bit colder and rainier than we would prefer (apparently the unseasonal rain is quite welcomed by the locals) and while the public transit is largely amazing, we have had some failed instances where a bus did arrive or didn’t stop for us. \n\n\n\nPlease feel free to email us anytime to stay in touch!! We want to know what you’re up to, highlights, excitements, and doldrums of 2023 so far. Please stay in touch…we always appreciate calls, video-chat dates, and even texts just saying “hi”.  Both our phone numbers are still the same. \n\n\n\nStay tuned for a Malta wrap-up post!",
  "author": [
    "Randi"
  ],
  "tag": [
    "Europe"
  ],
  "thumbnail": "/images/malta1.jpg",
  "description": "Hello friends and family from the Mediterranean!! After a wonderful holiday season, including a month with Tyler’s family in North Carolina and a month with my family in Colorado, Tyler and I are back out on our own and continuing to slow-travel. So far, 2023 is looking like the year of Europe."
}