{
  "date": "2023-03-30T06:41:19.288Z",
  "updatedDate": "2023-03-30T06:41:19.307Z",
  "body": "We were walking on the lovely 3-mile boardwalk around the bay in Fethiye. Today, they had a small tractor hooked up to a trailer and it was clear they were going to move a boat/ship.\\\n\\\nFirst a tractor pushed a trailer into place underneath the boat, which was propt up on cinder blocks and scrap wood. The trailer raises up slightly via hand powered pnumatic lifts and all the supports are removed. A dad with his son, in a Captain America costume, approach the tractor driver. We observing from a far, but we can only guess the dad asked \"hey, can my kid ride the tractor\" because the kid popped up onto the tractor and sat on the fender.\\\n\\\nAfter a bit, the tractor starts up. They start pulling the boat out of the ship yard and onto the street preparing to go round the corner to the dock (of course with kid on tractor). In the middle of the street, they stop and disconnect the tractor from the trailer and hook up a road grader. There is a guy on the ship who appears to be using a long-handled squeegee to hold up the power lines for the ship, squeegee is made of rubber, and the lines are probably data, so should be safe? In order to get the boat in to the water the grader goes pretty deep down the boat ramp. Pulls trailer out, disconnects from trailer. At which point tractor, with Captain America, re-connects to push the trailer back into the shipyard.\\\n\\\nThe whole event was a bit humorous, but the people of Fethiye have been repairing and launching boats for more then 2500 years, so we trust them.  Here are some pics of the grand event:\n\n![Boat being pulled out of yard by small tractor.](/images/fethiye-boat-launch-1.png \"Boat being pulled out of yard by small tractor.\")\n\n![Captain America and the smoking tractor driver](/images/fethiye-boat-launch-2.png \"Captain America and the smoking tractor driver\")",
  "thumbnail": "/images/fethiye-boat-launch-6.png",
  "title": "How to launch a boat in Fethiye",
  "description": "We got to see them move boats from a parking lot where they did dry repairs into the water",
  "author": [
    "Randi",
    "Tyler"
  ]
}