{
  "date": "2023-03-02T20:34:26.713Z",
  "updatedDate": "2023-03-02T20:34:26.726Z",
  "body": "## Stunning coastal hikes, amazing port, and the surprising delights of sardines! \n\nHi friends and family…hope all is well in 2023. We have really enjoyed the messages, emails, and calls from several of you…thanks for keeping in touch! \n\nTyler and I are finishing up a delightful 2-ish weeks in Portugal. If you’re interested in our high- (and low-) lights, continue reading. \n\nIf you are just here for the pics…:\n\n[The large urban city of Lisbon](https://photos.app.goo.gl/N3QYxCmXbG1xrfLT9)\n\n[A day of coastal hiking in the Dr. Sues world of Portimao](https://photos.app.goo.gl/m3Wbyd1pHPkBv2b78)\n\n[More coastal hiking…but this time with sun…in Lagos](https://photos.app.goo.gl/GFaFiQC4MZd7kd9Y6) \n\n#### Lisbon\n\nWe found Lisbon to be a bustling city with endless hills, but also endless pastry shops to refuel us throughout the day. Honestly, I didn’t find Lisbon to have quite the same charm as many other places, but Tyler really enjoyed the city. Admittedly, the artful sidewalks and tiled buildings made walking around more interesting (see below for example pic of the Lisbon sidewalks). Tyler’s favorite activities were the Maritime Museum, guided port tasting (he has been a long-time friend of port, but enjoyed learning more about the origins), and meeting up with a past colleague, Peter, for a personalized walking tour. I was surprised we both decided we are sardine people. Yep, canned fish for us. Pour some olive oil on those bad boys, pair them with a vinho verde and some fresh bread…we’re all about it. \n\nUPDATE: We quickly consumed too many sardines and we are sardine people no longer.\n\n![So many pretty tiles around Lisbon](/images/portugal2.jpg \"So many pretty tiles around Lisbon\")\n\n#### Portimao\n\nOur first introduction to the Algarve (the region of south-western Portugal) was the town of Portimao, where we spent two nights. Our main purpose here was to complete two back-to-back coastal treks for a total of 13-miles (Seven Hanging Valleys Trail and the Trail of Headlands). The hike proved to be everybit worth the effort. As we hiked over a trail of heavily eroded limestone, each new bend brought us to another astounding cliffside vista or pristine secluded beach. Many of the beaches could only be accessed by boat or by hiking through caves or climbing down sinkholes. The weather was cloudy nearly all day and it sprinkled on us a few times; but this will absolutely remain one of my favorite hikes of all time. \n\n\n\n![Cool cliffs all around!](/images/portugal3.jpg \"Cool cliffs all around!\")\n\n![Sink holes leading to hidden beaches](/images/portugal4.jpg \"Sink holes leading to hidden beaches\")\n\n![Hidden beaches!](/images/portugal5.jpg \"Hidden beaches!\")\n\n#### Lagos\n\nJust when we were thinking the Algarve coastline couldn’t get any more beautiful, we got two days of bright blue skies and brilliant sun to accompany our coastal hiking adventures. The waters along the coastline have that turquoise to deep blue color feature that makes the postcards sparkle. Another unique feature of the cliff-backed beaches near town is many of them are connected by man-made cave walkways. \n\nAll in all we enjoyed a week in Lagos. The hiking trails and “secluded” beaches were a little more popular in Lagos, which gave us the opportunity to meet other travelers. We talked with a 60-something retired nomad couple who’ve been traveling around the globe for two years. We enjoyed drinks with the couple responsible for stingynomads.com; they gave amazing local hiking recommendations (as they now have settled in Lagos to begin raising a family).\n\nWe were able to utilize the local bus to enjoy several coastal hikes and small sea-side towns along the southern Mediterranean and western Atlantic coasts of the Algarve. All-in-all, we found the Algarve to be accessible and astoundingly beautiful. Seems to be a very popular place for british and canadian snowbirds and expats (thus English is pretty much spoken everywhere). \n\nInsert photo: <https://photos.app.goo.gl/QTz4d25vNQqw5y1HA>\n\nInsert photo: <https://photos.app.goo.gl/UrXJBXiyU7eXKsGD6> \n\nIn summary, we enjoyed Portugal, particularly the southern Algarve region. We found the restaurant and grocery prices to be a bit similar to the US. Accommodations were similar to Malta (~$40/night) in price, but a bit lower in quality. Wine and seafood were abundant and delicious. The hiking exceeded expectations, however, outside of Lisbon the public transit was slightly less convenient/affordable. Hopefully someday we can return and visit more northern and eastern Portugal. \n\nNext up, we head to Turkey!! Sonra görüşürüz!!",
  "title": "Lisbon, Lagos, and Portimao…We’re in Portugal",
  "thumbnail": "/images/portugal1.jpg",
  "description": "Tyler and I are finishing up a delightful 2-ish weeks in Portugal. If you’re interested in our high- (and low-) lights, continue reading.",
  "tag": [
    "Europe"
  ],
  "author": [
    "Randi"
  ]
}